# Missing Data

Convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],
     'B':[5,np.nan,np.nan],
     'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna(axis = 0)      # DataFrame or None
# DataFrame with NA entries dropped from it or None if inplace=True.

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [9]:
df.dropna(thresh = 2)      # removes rows with na values more than 2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
df.fillna('Filled Value')

              A             B  C
0           1.0           5.0  1
1           2.0  Filled Value  2
2  Filled Value  Filled Value  3

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [15]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3